Revit 2027 API
PlasticVinyl.PlasticvinylApplication Property
 The property labeled "Finish" from the "PlasticVinyl" schema.
Namespace: Autodesk.Revit.DB.Visual
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static string PlasticvinylApplication { get; }
Public Shared ReadOnly Property PlasticvinylApplication As String
	Get
public:
static property String^ PlasticvinylApplication {
	String^ get ();
}
static member PlasticvinylApplication : string with get
Property Value
String
Remarks
 This property is of type "AssetPropertyInteger" with accepted values in the enumerated type "PlasticvinylApplicationType".
See Also
Reference
PlasticVinyl Class
Autodesk.Revit.DB.Visual Namespace